app/Http/Controllers/User/CartController.php

    public function index()
    {
        $user_id = Auth::id();

        $cart_products = Cart::where('user_id', $user_id)->get();
---
select * from `carts` where `user_id` = 1 and `carts`.`deleted_at` is null

    public function add(Request $request, $id)
    {
        $user_id = Auth::id();

        // 重複チェック
        $already = Cart::where('user_id', $user_id)->where('product_id', $id)->exists();
        if ($already) {
            return redirect()->route('user.cart');
        };

        Cart::insert([
            'user_id' => $user_id,
            'product_id' => $id
        ]);
---
select exists(select * from `carts` where `user_id` = 1 and `product_id` = '71' and `carts`.`deleted_at` is null) as `exists`
insert into `carts` (`user_id`, `product_id`) values (1, '71')

    public function delete(Request $request)
    {
        $user_id = Auth::id();
        $delete_id = $request->id;

        Cart::where('user_id', $user_id)->where('product_id', $delete_id)->delete();
---
update `carts` set `deleted_at` = '2022-01-16 22:49:07', `carts`.`updated_at` = '2022-01-16 22:49:07' where `user_id` = 1 and `product_id` = '31' and `carts`.`deleted_at` is null

    public function check(Request $request)
    {
        $user_id = Auth::id();
        $data = $request;

        $cart_products = Cart::where('user_id', $user_id)->get();
---
select * from `carts` where `user_id` = 1 and `carts`.`deleted_at` is null

    public function purchase(Request $request)
    {
        $user_id = Auth::id();
        $data = $request;

        $cart_products = Cart::where('user_id', $user_id)->get();

        // ユニークな購入IDとしてユーザーID＋日付を設定
        $purchase_group = $user_id . date(now());

        // 購入処理
        foreach ($cart_products as $cart_product) {
            $product_id = $data["product" . $cart_product->product_id . "_id"];
            $size = $data["product" . $cart_product->product_id . "_size"];
            $count = $data["product" . $cart_product->product_id . "_count"];

            Complete::insert([
                'user_id' => $user_id,
                'product_id' => $product_id,
                'size' => $size,
                'count' => $count,
                'purchase_group' => $purchase_group
            ]);
        }
        // 購入が終わったらカートの中身をデリート（ソフトデリート）
        Cart::where('user_id', $user_id)->delete();
---
select * from `carts` where `user_id` = 1 and `carts`.`deleted_at` is null
insert into `completes` (`user_id`, `product_id`, `size`, `count`, `purchase_group`) values (1, '71', 'S', '1', '12022-01-21 22:32:43')
update `carts` set `deleted_at` = '2022-01-18 22:25:27', `carts`.`updated_at` = '2022-01-18 22:25:27' where `user_id` = 1 and `carts`.`deleted_at` is null