app/Http/Controllers/User/KeepController.php

select `product_id` from `keeps` where `user_id` = 1 and `keeps`.`deleted_at` is null group by `product_id`
---
    public function index()
    {
        $user_id = Auth::id();

        $keep_products = Keep::where('user_id', $user_id)
            ->groupBy('product_id')
            ->select('product_id')->get();

select exists(select * from `keeps` where `keeps`.`deleted_at` is not null and `user_id` = 3 and `product_id` = '4') as `exists`
insert into `keeps` (`user_id`, `product_id`) values (3, '4')
---
    public function add(Request $request)
    {

        $user_id = Auth::id();
        $id = $request->id;

        // 既にソフトデリートされたものがあれば復活処理
        $already = Keep::onlyTrashed()->where('user_id', $user_id)->where('product_id', $id)->exists();

        if ($already) {
            Keep::onlyTrashed()->where('user_id', $user_id)->where('product_id', $id)->restore();
        } else {
            Keep::insert([
                'user_id' => $user_id,
                'product_id' => $id
            ]);

update `keeps` set `deleted_at` = '2022-01-18 14:07:10', `keeps`.`updated_at` = '2022-01-18 14:07:10' where `user_id` = 1 and `product_id` = '67' and `keeps`.`deleted_at` is null
---
    public function delete(Request $request, $id)
    {
        $user_id = Auth::id();

        Keep::where('user_id', $user_id)->where('product_id', $id)->delete();