app/Http/Controllers/User/ProductController.php

select * from `products`
---
    public function index()
    {
        $user = Auth::user();

        // 全ての商品
        $all_products = Product::all();

select * from `products`
select * from `products` where `gender` = 'mens_and_womens' or `gender` = 'womens'
select * from `products` where `gender` = 'mens_and_womens' or `gender` = 'mens'
select * from `products` where `category` = 'kids'
select * from `products` where `category` = 'trend'
---
    public function products()
    {
        $user = Auth::user();

        // 全ての商品
        $all_products = Product::all();

        // WOMENSに表示する商品を絞る機能
        $womens_products = Product::where('gender', 'mens_and_womens')->orWhere('gender', 'womens')->get();

        // MENSに表示する商品を絞る機能
        $mens_products = Product::where('gender', 'mens_and_womens')->orWhere('gender', 'mens')->get();

        // KIDSに表示する商品を絞る機能
        $kids_products = Product::where('category', 'kids')->get();

        // TRENDING NOWに表示する商品を絞る機能
        $trending_products = Product::where('category', 'trend')->get();