app/Http/Controllers/Admin/ProductController.php

select * from `products`
---
    public function index()
    {
        $products = Product::all();